Revit 2023 API
BuiltInFailures.CopyPasteFailures.CannotCopyMustBeUniqueViewportWarn Property
 Multiple instances of the same view in sheets not supported. CannotCopyMustBeUniqueViewportWarn is deprecated in Revit 2023 and may be removed in future verison of Revit. Please use ViewInAModelMustBeUniqueWarn instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyMustBeUniqueViewportWarn { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyMustBeUniqueViewportWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyMustBeUniqueViewportWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace